In [1]:
# Required python packages:
import sqlite3
import pandas as pd
import re

In [2]:
# Importing dataset:
df = pd.read_csv("indeedjobs2022.csv")

In [3]:
# Prevewing the values in each feature:
df.apply(lambda col: col.unique())

Title          [Master Data Analyst, Business Intelligence An...
Company        [Robert Half, Vault Credit Corporation, Staffw...
Location       [Calgary, AB, Montréal, QC, Toronto, ON, Ottaw...
JobLink        [https://ca.indeed.com/pagead/clk?mo=r&ad=-6NY...
CompanyLink    [https://ca.indeed.com/cmp/Robert-Half?campaig...
DatePosted     [2022-06-16, 2022-06-22, 2022-06-09, 2022-06-1...
ExtractDate                 [2022-06-22, 2022-06-23, 2022-06-25]
Description    [Our fast paced client in Calgary is currently...
Salary         [nan, $65,000–$75,000 a year, $50,000–$65,000 ...
JobType        [Temporary, Fixed term contract, nan, Full-tim...
Remote          [nan, Remote, Hybrid remote, Temporarily remote]
Reviews        [12,757 reviews, 2 reviews, 21 reviews, nan, 1...
Stars          [3.9, 3.5, nan, 3.7, 3.8, 4.1, 3.6, 3.3, 2.9, ...
dtype: object

In [4]:
#  Selecting features with missing values 
NA = [(c, df[c].isna().mean()*100) for c in df]
NA = pd.DataFrame(NA, columns=["column_name", "percentage"])

# Display the percentage of missing values in each feature
NA = NA[NA.percentage > 0]
NA.sort_values("percentage", ascending=False)

    column_name  percentage
8        Salary   80.728745
10       Remote   78.218623
9       JobType   34.898785
11      Reviews   23.805668
12        Stars   23.805668
2      Location    5.425101
1       Company    1.295547
4   CompanyLink    1.295547
0         Title    0.485830
7   Description    0.485830

In [5]:
df = df.drop_duplicates(subset=['Description'], keep='last')

In [6]:
#  Selecting features with missing values 
NA = [(c, df[c].isna().mean()*100) for c in df]
NA = pd.DataFrame(NA, columns=["column_name", "percentage"])

# Display the percentage of missing values in each feature 
NA = NA[NA.percentage > 0]
NA.sort_values("percentage", ascending=False)

    column_name  percentage
8        Salary   78.203240
10       Remote   76.730486
9       JobType   35.640648
11      Reviews   24.742268
12        Stars   24.742268
2      Location    4.565538
1       Company    1.178203
4   CompanyLink    1.178203
0         Title    0.147275
7   Description    0.147275

In [7]:
df.Description.str.lower().head(8)  # Convert all comments to lowercase

0     our fast paced client in calgary is currently ...
1     get to know vault credit corporation\nvault is...
5     adecco is currently hiring for a temporary, fu...
6     delta school district acknowledges that we lea...
7     are you interested in the world of data? do yo...
8     clinical data analyst – blood gas specialist \...
9     help us boldly shape retail in canada \ncanadi...
14    our client in the insurance industry is lookin...
Name: Description, dtype: object

In [18]:
python = df.Description.str.lower().str.contains("python")

In [20]:
tableau = df.Description.str.lower().str.contains("tableau")

In [21]:
logical_index.head(50)

0      False
1       True
5      False
6      False
7      False
8      False
9      False
14     False
18     False
20     False
46     False
81     False
82     False
83     False
84     False
92     False
95     False
100    False
102    False
108    False
109     True
124    False
125    False
126    False
127    False
131    False
133    False
135    False
136    False
137    False
140    False
170    False
172    False
173    False
174    False
175    False
176    False
177     True
178    False
179    False
180    False
181    False
182     True
183    False
184     True
187    False
189    False
194    False
196    False
201    False
Name: Description, dtype: object

In [10]:
df.Description.str.len().head(30)  # Get the length of all comments

0      2386.0
1      3001.0
5      2376.0
6      3618.0
7      4461.0
8      1532.0
9      4604.0
14     3903.0
18     3717.0
20     4163.0
46     4407.0
81     6282.0
82     5425.0
83     4915.0
84     3782.0
92     5330.0
95     3050.0
100    7736.0
102    5084.0
108    2305.0
109    4849.0
124    8633.0
125    5367.0
126    1167.0
127    8709.0
131    3306.0
133    7269.0
135    5172.0
136    1163.0
137    9269.0
Name: Description, dtype: float64

In [11]:
print(df)

                                                  Title  \
0                                   Master Data Analyst
1                         Business Intelligence Analyst
5          Clinical Data Analyst - Blood Gas Specialist
6                                        Senior Analyst
7     Business Analyst - Data Specialist - Insurance...
...                                                 ...
1230                                Senior ITAM Analyst
1231  Business Technology Analyst - OpenRoad Head Of...
1232      Business Intelligence (BI) Developer- Analyst
1233                                      Fleet Analyst
1234                                  Logistics Analyst

                          Company       Location  \
0                     Robert Half    Calgary, AB
1        Vault Credit Corporation   Montréal, QC
5                   Adecco Canada     Ottawa, ON
6     School District #37 (Delta)      Delta, BC
7                        Randstad   Montréal, QC
...                           ...            ...
1230                   Scotiabank    Toronto, ON
1231          OpenRoad Auto Group   Richmond, BC
1232       Providence Health Care  Vancouver, BC
1233                     RMSI Inc    Toronto, ON
1234            Midland Transport     Dieppe, NB

                                                JobLink  \
0     https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYl...
1     https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYl...
5     https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYl...
6     https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYl...
7     https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYl...
...                                                 ...
1230  https://ca.indeed.com/rc/clk?jk=356e92ca5941d1...
1231  https://ca.indeed.com/rc/clk?jk=8c5c581a6614cb...
1232  https://ca.indeed.com/company/Lower-Mainland-B...
1233  https://ca.indeed.com/company/RMSI-Inc/jobs/Fl...
1234  https://ca.indeed.com/rc/clk?jk=b6f4b34b108760...

                                            CompanyLink  DatePosted  \
0     https://ca.indeed.com/cmp/Robert-Half?campaign...  2022-06-16
1     https://ca.indeed.com/cmp/Vault-Credit-Corpora...  2022-06-22
5     https://ca.indeed.com/cmp/Adecco?campaignid=mo...  2022-06-14
6     https://ca.indeed.com/cmp/School-District-%233...  2022-06-18
7     https://ca.indeed.com/cmp/Randstad?campaignid=...  2022-06-22
...                                                 ...         ...
1230  https://ca.indeed.com/cmp/Scotiabank?campaigni...  2022-06-13
1231  https://ca.indeed.com/cmp/Openroad-Auto-Group?...  2022-06-25
1232  https://ca.indeed.com/cmp/Lower-Mainland-Biome...  2022-06-15
1233  https://ca.indeed.com/cmp/Rmsi-Inc-1?campaigni...  2022-06-25
1234  https://ca.indeed.com/cmp/J.d.-Irving?campaign...  2022-06-18

     ExtractDate                                        Description  \
0     2022-06-22  Our fast paced client in Calgary is currently ...
1     2022-06-22  Get to Know Vault Credit Corporation\nVault is...
5     2022-06-22  Adecco is currently hiring for a temporary, fu...
6     2022-06-22  Delta School District acknowledges that we lea...
7     2022-06-22  Are you interested in the world of data? Do yo...
...          ...                                                ...
1230  2022-06-25  Requisition ID: 154519  Join a purpose driven ...
1231  2022-06-25  UNLIMITED POSSIBILITIES AHEAD\n\n Position: Bu...
1232  2022-06-25  JOB SUMMARY: Reporting to the Manager, Data An...
1233  2022-06-25  The Fleet Analyst is responsible for the effec...
1234  2022-06-25  LOGISTICS ANALYST\n\n Midland Transport Limite...

                      Salary                         JobType  Remote  \
0                        NaN  Temporary, Fixed term contract     NaN
1     $65,000–$75,000 a year                             NaN     NaN
5                        NaN             Fixed term contract     NaN
6                        NaN                       Full-time     NaN
7                        NaN                             NaN  Remote
...                      ...                             ...     ...
1230                     NaN                       Permanent     NaN
1231                     NaN                       Full-time     NaN
1232                     NaN  Full-time, Fixed term contract     NaN
1233                     NaN  Full-time, Fixed term contract     NaN
1234                     NaN                             NaN     NaN

             Reviews  Stars
0     12,757 reviews    3.9
1          2 reviews    3.5
5     18,938 reviews    3.8
6                NaN    NaN
7     17,025 reviews    3.7
...              ...    ...
1230   5,029 reviews    3.9
1231      76 reviews    2.7
1232             NaN    NaN
1233             NaN    NaN
1234     154 reviews    2.7

[679 rows x 13 columns]